<?php

return [
    'validation' => [
        'store' => [
            'messages' => [
                'image.file' => 'الملف يجب أن يكون ملف',
                'name.string' => 'الاسم يجب أن يكون نص',
                'job.string' => 'الوظيفة يجب أن تكون نص',
                'message.string' => 'الرسالة يجب أن تكون نص',
                'rate.string' => 'التقييم يجب أن يكون نص',
            ],
            'attributes' => [
                'image' => 'الصورة',
                'name' => 'الاسم',
                'job' => 'الوظيفة',
                'message' => 'الرسالة',
                'rate' => 'التقييم',
            ],
        ],
        'update' => [
            'messages' => [
                'id.exists' => 'الشهادة المحددة غير موجودة',
                'name.string' => 'الاسم يجب أن يكون نص',
                'job.string' => 'الوظيفة يجب أن تكون نص',
                'message.string' => 'الرسالة يجب أن تكون نص',
                'rate.string' => 'التقييم يجب أن يكون نص',
            ],
            'attributes' => [
                'id' => 'معرف الشهادة',
                'name' => 'الاسم',
                'job' => 'الوظيفة',
                'message' => 'الرسالة',
                'rate' => 'التقييم',
            ],
        ],
        'update_all' => [
            'messages' => [
                '*.required' => 'البيانات مطلوبة',
                '*.array' => 'البيانات يجب أن تكون مصفوفة',
                '*.id.required' => 'معرف الشهادة مطلوب',
                '*.id.integer' => 'معرف الشهادة يجب أن يكون رقم صحيح',
                '*.id.exists' => 'الشهادة المحددة غير موجودة',
                '*.name.string' => 'الاسم يجب أن يكون نص',
                '*.job.string' => 'الوظيفة يجب أن تكون نص',
                '*.message.string' => 'الرسالة يجب أن تكون نص',
                '*.rate.string' => 'التقييم يجب أن يكون نص',
            ],
            'attributes' => [
                '*' => 'البيانات',
                '*.id' => 'معرف الشهادة',
                '*.name' => 'الاسم',
                '*.job' => 'الوظيفة',
                '*.message' => 'الرسالة',
                '*.rate' => 'التقييم',
            ],
        ],
        'delete' => [
            'messages' => [
                'id.exists' => 'الشهادة المحددة غير موجودة',
            ],
            'attributes' => [
                'id' => 'معرف الشهادة',
            ],
        ],
    ],
];
